#### [`repos`] Terraform Plan 📖`success`

<a href="https://app.terraform.io/app/cdktf-team/prebuilt-providers/runs/run-6bNyVRL1a2y5UcS5" target="_blank">Remote Plan Link ↗️</a>

<details><summary>Show Plan</summary>

```tf
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cdktf-team/prebuilt-providers/runs/run-6bNyVRL1a2y5UcS5

Waiting for the plan to start...

Terraform v1.12.1
on linux_amd64
Initializing plugins and modules...
data.github_team.cdktf-team-cdktf: Reading...
data.github_team.cdktf-team-cdktf: Read complete after 9s [id=6602018]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_actions_secret.cdktf-repository-manager_repo_secret-gh-comment-token_D52FE846 will be created
  + resource "github_actions_secret" "cdktf-repository-manager_repo_secret-gh-comment-token_D52FE846" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-repository-manager"
      + secret_name     = "GH_COMMENT_TOKEN"
      + updated_at      = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @xiehan, Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*